Repository: LaKwiss/espn_app
Catalog: lib/l10n/app_*.arb
Languages: fr

# appTitle
source: ESPN App
fr: App ESPN

source: No events available
fr: Aucun événement disponible

# errorLoadingEventsGeneric
source: Error loading events: {error}
fr: Erreur lors du chargement des événements : {error}

source: Try Again
fr: Réessayer

# calendarTitle
source: CALENDAR
fr: CALENDRIER

# errorLoadingMatches
source: Failed to load matches
fr: Échec du chargement des matchs

# noMatchesOnDate
source: No matches scheduled on {date}
fr: Aucun match prévu le {date}

# tryAnotherDateOrLeague
source: Try selecting another date or league
fr: Essayez de sélectionner une autre date ou ligue

# leagueLigue1
source: French Ligue 1
fr: Ligue 1 Française

# leagueSerieA
source: Italian Serie A
fr: Serie A Italienne

# leagueChampionsLeague
source: Champions League
fr: Ligue des Champions

# matchStatusInProgress
source: IN PROGRESS
fr: EN COURS

# matchStatusFinished
source: FINISHED
fr: TERMINÉ

# matchStatusUpcoming
source: UPCOMING
fr: À VENIR

# defaultAwayTeam
source: Away Team
fr: Équipe Extérieur

# defaultHomeTeam
source: Home Team
fr: Équipe Domicile

source: Error
fr: Erreur

source: Past Games
fr: Matchs Passés

source: Error loading probabilities
fr: Erreur chargement probabilités

# probabilityAwayWin
source: {teamName} WIN {percentage}
fr: VICT. {teamName} {percentage}

# probabilityDraw
source: DRAW {percentage}
fr: NUL {percentage}

# probabilityHomeWin
source: {teamName} WIN {percentage}
fr: VICT. {teamName} {percentage}

# probabilityDrawShort
source: DRAW {percentage}
fr: NUL {percentage}

# noEventsRecorded
source: No events recorded for this match yet.
fr: Aucun événement enregistré pour ce match pour le moment.

# checkBackLaterForUpdates
source: Check back later for live updates or results.
fr: Revenez plus tard pour les mises à jour en direct ou les résultats.

# matchEventsTitle
source: MATCH EVENTS
fr: ÉVÉNEMENTS DU MATCH

source: Unknown Player
fr: Joueur Inconnu

# goalScoreUpdate
source: {teamName} takes the lead! Score: {homeGoals} - {awayGoals}
fr: {teamName} mène ! Score : {homeGoals} - {awayGoals}

# goalScoredBy
source: GOAL! Scored by {playerName}
fr: BUT ! Marqué par {playerName}

source: Goal at {time}
fr: But à {time}

# teamId
source: Team ID: {id}
fr: ID Équipe : {id}

source: Unknown
fr: Inconnu

source: LAST 5 MATCHES
fr: 5 DERNIERS MATCHS

# legendWin
source: Win
fr: Victoire

# legendDraw
source: Draw
fr: Nul

# legendLoss
source: Loss
fr: Défaite

# eventsTab
source: Events
fr: Événements

source: Information will follow
fr: Les informations suivront

# checkBackAfterKickoff
source: Check back after kick-off for live details.
fr: Revenez après le coup d'envoi pour les détails en direct.

source: Refresh
fr: Rafraîchir

source: Loading events...
fr: Chargement des événements...

# loadingTacticsData
source: Loading tactical data...
fr: Chargement données tactiques...

# errorLoadingTactics
source: Error loading tactics: {error}
fr: Erreur chargement tactiques : {error}

# substitutedOutAt
source: Substituted out at {minute}
fr: Sorti à la {minute}

# substitutedInAt
source: Substituted in at {minute}
fr: Entré à la {minute}

# yellowCardLabel
source: Yellow Card
fr: Carton Jaune

# redCardLabel
source: Red Card
fr: Carton Rouge

# closeButton
source: Close
fr: Fermer

# substitutesTitle
source: {teamName} - Substitutes
fr: {teamName} - Remplaçants

# changesTitle
source: Changes
fr: Changements

# teamFormation
source: {teamName} Formation ({formation})
fr: Formation {teamName} ({formation})

# hideEventsTooltip
source: Hide Events
fr: Masquer Événements

# showEventsTooltip
source: Show Events
fr: Afficher Événements

source: Error loading scores
fr: Erreur chargement scores

# settingsTitle
source: SETTINGS
fr: PARAMÈTRES

# notificationsDescription
source: Receive match start and goal alerts (Coming soon)
fr: Recevoir alertes début match et buts (Bientôt)

# notificationsUnderDevelopment
source: Notifications are still under development.
fr: Les notifications sont en cours de développement.

source: Dark Mode
fr: Mode Sombre

# darkModeDescription
source: Enable dark theme for the app
fr: Activer le thème sombre pour l'application

source: Language
fr: Langue

# languageDescription
source: Choose the application language
fr: Choisir la langue de l'application

source: Cache Data
fr: Données en Cache

# cacheDataDescription
source: Store match data locally for offline access and faster loading
fr: Stocker données matchs localement pour accès hors ligne

source: Clear Cache
fr: Vider le Cache

# clearCacheDescription
source: Remove all locally stored match data
fr: Supprimer toutes les données de match stockées localement

# clearCacheConfirmation
source: Are you sure you want to clear all cached data? This cannot be undone.
fr: Voulez-vous vraiment vider tout le cache ? Cette action est irréversible.

source: Cancel
fr: Annuler

source: Clearing cache...
fr: Vidage du cache...

# cacheCleared
source: Cache cleared successfully.
fr: Cache vidé avec succès.

source: Clear
fr: Vider

source: Color Picker
fr: Sélecteur de Couleurs

# colorPickerDescription
source: Customize UI colors
fr: Personnaliser les couleurs de l'interface

source: About
fr: À Propos

# aboutDescription
source: View application information and credits
fr: Voir informations sur l'application et crédits

# aboutAppDescription
source: This app displays soccer match information using data from ESPN APIs. It is intended for informational and demonstration purposes.
fr: Cette application affiche des informations sur les matchs de football en utilisant les données des API ESPN. Elle est destinée à des fins d'information et de démonstration.

# copyright
source: Data provided by ESPN. All rights reserved.
fr: Données fournies par ESPN. Tous droits réservés.

source: Visit ESPN
fr: Visiter ESPN

# visitEspnDescription
source: Go to the official ESPN soccer website
fr: Aller sur le site officiel de football d'ESPN

source: Could not launch {url}
fr: Impossible d'ouvrir {url}

# developedWith
source: Developed with Flutter
fr: Développé avec Flutter

source: Edit color
fr: Modifier couleur

source: Add new color
fr: Ajouter couleur

source: Update
fr: Mettre à jour

source: Add
fr: Ajouter

# colorsTitle
source: COLORS
fr: COULEURS

source: Color #{index}
fr: Couleur #{index}

# editColorTooltip
source: Edit color
fr: Modifier couleur

# deleteColorTooltip
source: Delete color
fr: Supprimer couleur

# addNewColorTooltip
source: Add new color
fr: Ajouter nouvelle couleur

# headerAt
source: AT
fr: CHEZ

# headerFirstLeg
source: FIRST LEG
fr: MATCH ALLER

# statsGoals
source: Goals
fr: Buts

# statsAssists
source: Assists
fr: Passes D.

# statsShots
source: Shots
fr: Tirs

# statsSaves
source: Saves
fr: Arrêts

# statsFouls
source: Fouls
fr: Fautes

# statsYellowCards
source: Yellow Cards
fr: Cartons J.

# statsRedCards
source: Red Cards
fr: Cartons R.
